In [1]:
import pandas as pd
import numpy as np

In [6]:
data = {
    "Name": ["Ali", "Waqas", "Naeem", "Raza", "Maaz", "Usman", "Waqar"] ,
    "Age": [24, 45, 13, 76, 19, 14, 27],
    "Gender": ['M', 'F', 'M', 'F', 'M', 'M', 'M'],
    "Marks": [34, 'NaN', 56, 'NaN', 78, 90, 'NaN']
}
data

{'Name': ['Ali', 'Waqas', 'Naeem', 'Raza', 'Maaz', 'Usman', 'Waqar'],
 'Age': [24, 45, 13, 76, 19, 14, 27],
 'Gender': ['M', 'F', 'M', 'F', 'M', 'M', 'M'],
 'Marks': [34, 'NaN', 56, 'NaN', 78, 90, 'NaN']}

In [8]:
dataframe = pd.DataFrame(data)
dataframe

    Name  Age Gender Marks
0    Ali   24      M    34
1  Waqas   45      F   NaN
2  Naeem   13      M    56
3   Raza   76      F   NaN
4   Maaz   19      M    78
5  Usman   14      M    90
6  Waqar   27      M   NaN

In [18]:
# Dealing with missing values
count = marks_sum = average = 0
for value in dataframe["Marks"]:
    if str(value).isnumeric():
        marks_sum = marks_sum + value
        count = count + 1

average = marks_sum / count
average

64.5

In [19]:
dataframe.replace(to_replace="NaN", value=average)

    Name  Age Gender  Marks
0    Ali   24      M   34.0
1  Waqas   45      F   64.5
2  Naeem   13      M   56.0
3   Raza   76      F   64.5
4   Maaz   19      M   78.0
5  Usman   14      M   90.0
6  Waqar   27      M   64.5

In [21]:
new_dataframe = pd.DataFrame(data)
new_dataframe

    Name  Age Gender Marks
0    Ali   24      M    34
1  Waqas   45      F   NaN
2  Naeem   13      M    56
3   Raza   76      F   NaN
4   Maaz   19      M    78
5  Usman   14      M    90
6  Waqar   27      M   NaN

In [22]:
new_dataframe["Age"].mean()

31.142857142857142

In [ ]:
new_dataframe["Marks"].mean() # will not work because some values are NaN

In [24]:
# Encoding / Reshapping data
dataframe["Gender"] = dataframe["Gender"].map({ 'M': 0, 'F': 1 }).astype(float)
dataframe

    Name  Age  Gender Marks
0    Ali   24     0.0    34
1  Waqas   45     1.0   NaN
2  Naeem   13     0.0    56
3   Raza   76     1.0   NaN
4   Maaz   19     0.0    78
5  Usman   14     0.0    90
6  Waqar   27     0.0   NaN